iSYSTEMLabs/winIDEAExampleWorkspaces/TI/CC2650/emptyTargetInit/CC2650_sfr.h
};

#define AUX_AIODIO1 (*(volatile struct AUX_AIODIO1_tag *) 0x400c2000)

struct AUX_ANAIF_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMD:2;
      uint64_t reservedSpace0:6;
      uint64_t START_SRC:5;
      uint64_t START_POL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADCCTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EMPTY:1;
      uint64_t ALMOST_FULL:1;
      uint64_t FULL:1;
      uint64_t UNDERFLOW:1;
      uint64_t OVERFLOW:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADCFIFOSTAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADCFIFO;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t START:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADCTRIG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESET_N:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ISRCCTL;

};

#define AUX_ANAIF (*(volatile struct AUX_ANAIF_tag *) 0x400c9010)

struct AUX_DDI0_OSC_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t SCLK_HF_SRC_SEL:1;
      uint64_t SCLK_MF_SRC_SEL:1;
      uint64_t SCLK_LF_SRC_SEL:2;
      uint64_t reservedSpace0:1;
      uint64_t ACLK_REF_SRC_SEL:2;
      uint64_t ACLK_TDC_SRC_SEL:2;
      uint64_t CLK_LOSS_EN:1;
      uint64_t XOSC_LF_DIG_BYPASS:1;
      uint64_t XOSC_HF_POWER_MODE:1;
      uint64_t RCOSC_LF_TRIMMED:1;
      uint64_t reservedSpace1:3;
      uint64_t ALLOW_SCLK_HF_SWITCHING:1;
      uint64_t reservedSpace2:5;
      uint64_t FORCE_KICKSTART_EN:1;
      uint64_t reservedSpace3:2;
      uint64_t DOUBLER_RESET_DURATION:1;
      uint64_t DOUBLER_START_DURATION:2;
      uint64_t BYPASS_RCOSC_LF_CLK_QUAL:1;
      uint64_t BYPASS_XOSC_LF_CLK_QUAL:1;
      uint64_t reservedSpace4:1;
      uint64_t XTAL_IS_24M:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTL0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XOSC_HF_FAST_START:2;
      uint64_t reservedSpace0:15;
      uint64_t RCOSCHFCTRIMFRACT_EN:1;
      uint64_t RCOSCHFCTRIMFRACT:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTL1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:5;
      uint64_t RADC_MODE_IS_SAR:1;
      uint64_t RADC_DAC_TH:6;
      uint64_t IDAC_STEP:4;
      uint64_t LPM_IBIAS_WAIT_CNT:6;
      uint64_t HPM_IBIAS_WAIT_CNT:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RADCEXTCFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IBIASCAP_HPTOLP_OL_CNT:4;
      uint64_t CAP_STEP:4;
      uint64_t LPM_IBIAS_WAIT_CNT_FINAL:8;
      uint64_t IBIAS_INIT:4;
      uint64_t IBIAS_OFFSET:4;
      uint64_t reservedSpace0:2;
      uint64_t AMPCOMP_SW_EN:1;
      uint64_t AMPCOMP_SW_CTRL:1;
      uint64_t AMPCOMP_FSM_UPDATE_RATE:2;
      uint64_t AMPCOMP_REQ_MODE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AMPCOMPCTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HPMRAMP1_TH:6;
      uint64_t IBIASCAP_LPTOHP_OL_CNT:4;
      uint64_t HPMRAMP3_HTH:6;
      uint64_t reservedSpace0:2;
      uint64_t HPMRAMP3_LTH:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AMPCOMPTH1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t ADC_COMP_AMPTH_HPM:6;
      uint64_t reservedSpace1:2;
      uint64_t ADC_COMP_AMPTH_LPM:6;
      uint64_t reservedSpace2:2;
      uint64_t LPMUPDATE_HTH:6;
      uint64_t reservedSpace3:2;
      uint64_t LPMUPDATE_LTH:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AMPCOMPTH2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XOSC_HF_COLUMN_Q12:16;
      uint64_t XOSC_HF_ROW_Q12:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ANABYPASSVAL1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XOSC_HF_IBIASTHERM:14;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ANABYPASSVAL2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:29;
      uint64_t SCLK_LF_AUX_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ATESTCTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_IREF_CTRL:2;
      uint64_t reservedSpace0:2;
      uint64_t ADC_SH_VBUF_EN:1;
      uint64_t ADC_SH_MODE_EN:1;
      uint64_t reservedSpace1:17;
      uint64_t SPARE23:1;
      uint64_t NANOAMP_BIAS_ENABLE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADCDOUBLERNANOAMPCTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LP_BUF_ITRIM:2;
      uint64_t HP_BUF_ITRIM:3;
      uint64_t reservedSpace0:1;
      uint64_t BYPASS:1;
      uint64_t reservedSpace1:1;
      uint64_t PEAK_DET_ITRIM:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) XOSCHFCTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RCOSCLF_CTUNE_TRIM:8;
      uint64_t RCOSCLF_RTUNE_TRIM:2;
      uint64_t reservedSpace0:8;
      uint64_t XOSCLF_CMIRRWR_RATIO:4;
      uint64_t XOSCLF_REGULATOR_TRIM:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LFOSCCTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t RCOSCHF_CTRIM:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCOSCHFCTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PENDINGSCLKHFSWITCHING:1;
      uint64_t ADC_DATA:6;
      uint64_t ADC_DATA_READY:1;
      uint64_t ADC_THMET:1;
      uint64_t reservedSpace0:1;
      uint64_t XOSC_HF_HP_BUF_EN:1;
      uint64_t XOSC_HF_LP_BUF_EN:1;
      uint64_t reservedSpace1:1;
      uint64_t XB_48M_CLK_EN:1;
      uint64_t reservedSpace2:1;
      uint64_t XOSC_HF_EN:1;
      uint64_t SCLK_LF_LOSS:1;
      uint64_t SCLK_HF_LOSS:1;
      uint64_t CLK_DCDC_RDY_ACK:1;
      uint64_t CLK_DCDC_RDY:1;
      uint64_t XOSC_LF_EN:1;
      uint64_t RCOSC_LF_EN:1;
      uint64_t RCOSC_HF_EN:1;
      uint64_t reservedSpace3:5;
      uint64_t SCLK_HF_SRC:1;
      uint64_t SCLK_LF_SRC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STAT0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLK_DCDC_GOOD:1;
      uint64_t CLK_CHP_GOOD:1;
      uint64_t ACLK_REF_GOOD:1;
      uint64_t ACLK_TDC_GOOD:1;
      uint64_t ACLK_ADC_GOOD:1;
      uint64_t SCLK_LF_GOOD:1;
      uint64_t SCLK_MF_GOOD:1;
      uint64_t SCLK_HF_GOOD:1;
      uint64_t CLK_DCDC_EN:1;
      uint64_t CLK_CHP_EN:1;
      uint64_t ACLK_REF_EN:1;
      uint64_t ACLK_TDC_EN:1;
      uint64_t ACLK_ADC_EN:1;
      uint64_t SCLK_MF_EN:1;
      uint64_t SCLK_HF_EN:1;
      uint64_t FORCE_RCOSC_HF:1;
      uint64_t LPM_UPDATE_AMP:6;
      uint64_t HMP_UPDATE_AMP:6;
      uint64_t RAMPSTATE:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STAT1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XOSC_HF_RF_FREQGOOD:1;
      uint64_t XOSC_HF_FREQGOOD:1;
      uint64_t XOSC_HF_AMPGOOD:1;
      uint64_t AMPCOMP_REQ:1;
      uint64_t reservedSpace0:8;
      uint64_t RAMPSTATE:4;
      uint64_t reservedSpace1:7;
      uint64_t HPM_RAMP3_THMET:1;
      uint64_t HPM_RAMP2_THMET:1;
      uint64_t HPM_RAMP1_THMET:1;
      uint64_t ADC_DCBIAS:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STAT2;

