iSYSTEMLabs/winIDEAExampleWorkspaces/TI/CC2650/emptyTargetInit/CC2650_sfr.h
  uint8_t res1[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SMPH_bitfield:1;
      uint64_t AIODIO0:1;
      uint64_t AIODIO1:1;
      uint64_t TIMER:1;
      uint64_t ANAIF:1;
      uint64_t reservedSpace0:1;
      uint64_t AUX_DDI0_OSC_bitfield:1;
      uint64_t AUX_ADI4_bitfield:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MODCLKEN1;

};

#define AUX_WUC (*(volatile struct AUX_WUC_tag *) 0x400c6000)

struct CCFG_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t RTC_INCREMENT:24;
      uint64_t DIO:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EXT_LF_CLK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XOSC_MAX_START:8;
      uint64_t DELTA_IBIAS_OFFSET:4;
      uint64_t DELTA_IBIAS_INIT:4;
      uint64_t ALT_DCDC_IPEAK:3;
      uint64_t ALT_DCDC_DITHER_EN:1;
      uint64_t ALT_DCDC_VMIN:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MODE_CONF_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIS_XOSC_OVR:1;
      uint64_t DIS_ALT_DCDC_SETTING:1;
      uint64_t DISABLE_FLAGS:14;
      uint64_t SIZE_OF_CCFG:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SIZE_AND_DIS_FLAGS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VDDR_CAP:8;
      uint64_t XOSC_CAPARRAY_DELTA:8;
      uint64_t HF_COMP:1;
      uint64_t XOSC_CAP_MOD:1;
      uint64_t XOSC_FREQ:2;
      uint64_t RTC_COMP:1;
      uint64_t reservedSpace0:1;
      uint64_t SCLK_LF_OPTION:2;
      uint64_t VDDS_BOD_LEVEL:1;
      uint64_t VDDR_EXT_LOAD:1;
      uint64_t DCDC_ACTIVE:1;
      uint64_t DCDC_RECHARGE:1;
      uint64_t VDDR_TRIM_SLEEP_DELTA:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MODE_CONF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VDDR_EXT_TM15:8;
      uint64_t VDDR_EXT_TP5:8;
      uint64_t VDDR_EXT_TP25:8;
      uint64_t VDDR_EXT_TP45:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) VOLT_LOAD_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VDDR_EXT_TP65:8;
      uint64_t VDDR_EXT_TP85:8;
      uint64_t VDDR_EXT_TP105:8;
      uint64_t VDDR_EXT_TP125:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) VOLT_LOAD_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RTC_COMP_P2:8;
      uint64_t RTC_COMP_P1:8;
      uint64_t RTC_COMP_P0:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTC_OFFSET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HF_COMP_P2:8;
      uint64_t HF_COMP_P1:8;
      uint64_t HF_COMP_P0:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FREQ_OFFSET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IEEE_MAC_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IEEE_MAC_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IEEE_BLE_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IEEE_BLE_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BL_ENABLE:8;
      uint64_t BL_PIN_NUMBER:8;
      uint64_t BL_LEVEL:1;
      uint64_t reservedSpace0:7;
      uint64_t BOOTLOADER_ENABLE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BL_CONFIG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BANK_ERASE_DIS_N:1;
      uint64_t reservedSpace0:7;
      uint64_t CHIP_ERASE_DIS_N:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERASE_CONF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TI_FA_ENABLE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCFG_TI_OPTIONS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TEST_TAP_ENABLE:8;
      uint64_t PRCM_TAP_ENABLE:8;
      uint64_t CPU_DAP_ENABLE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCFG_TAP_DAP_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WUC_TAP_ENABLE:8;
      uint64_t PBIST1_TAP_ENABLE:8;
      uint64_t PBIST2_TAP_ENABLE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCFG_TAP_DAP_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IMAGE_VALID:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMAGE_VALID_CONF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WRT_PROT_SEC_0:1;
      uint64_t WRT_PROT_SEC_1:1;
      uint64_t WRT_PROT_SEC_2:1;
      uint64_t WRT_PROT_SEC_3:1;
      uint64_t WRT_PROT_SEC_4:1;
      uint64_t WRT_PROT_SEC_5:1;
      uint64_t WRT_PROT_SEC_6:1;
      uint64_t WRT_PROT_SEC_7:1;
      uint64_t WRT_PROT_SEC_8:1;
      uint64_t WRT_PROT_SEC_9:1;
      uint64_t WRT_PROT_SEC_10:1;
      uint64_t WRT_PROT_SEC_11:1;
      uint64_t WRT_PROT_SEC_12:1;
      uint64_t WRT_PROT_SEC_13:1;
      uint64_t WRT_PROT_SEC_14:1;
      uint64_t WRT_PROT_SEC_15:1;
      uint64_t WRT_PROT_SEC_16:1;
      uint64_t WRT_PROT_SEC_17:1;
      uint64_t WRT_PROT_SEC_18:1;
      uint64_t WRT_PROT_SEC_19:1;
      uint64_t WRT_PROT_SEC_20:1;
      uint64_t WRT_PROT_SEC_21:1;
      uint64_t WRT_PROT_SEC_22:1;
      uint64_t WRT_PROT_SEC_23:1;
      uint64_t WRT_PROT_SEC_24:1;
      uint64_t WRT_PROT_SEC_25:1;
      uint64_t WRT_PROT_SEC_26:1;
      uint64_t WRT_PROT_SEC_27:1;
      uint64_t WRT_PROT_SEC_28:1;
      uint64_t WRT_PROT_SEC_29:1;
      uint64_t WRT_PROT_SEC_30:1;
      uint64_t WRT_PROT_SEC_31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCFG_PROT_31_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WRT_PROT_SEC_32:1;
      uint64_t WRT_PROT_SEC_33:1;
      uint64_t WRT_PROT_SEC_34:1;
      uint64_t WRT_PROT_SEC_35:1;
      uint64_t WRT_PROT_SEC_36:1;
      uint64_t WRT_PROT_SEC_37:1;
      uint64_t WRT_PROT_SEC_38:1;
      uint64_t WRT_PROT_SEC_39:1;
      uint64_t WRT_PROT_SEC_40:1;
      uint64_t WRT_PROT_SEC_41:1;
      uint64_t WRT_PROT_SEC_42:1;
      uint64_t WRT_PROT_SEC_43:1;
      uint64_t WRT_PROT_SEC_44:1;
      uint64_t WRT_PROT_SEC_45:1;
      uint64_t WRT_PROT_SEC_46:1;
      uint64_t WRT_PROT_SEC_47:1;
      uint64_t WRT_PROT_SEC_48:1;
      uint64_t WRT_PROT_SEC_49:1;
      uint64_t WRT_PROT_SEC_50:1;
      uint64_t WRT_PROT_SEC_51:1;
      uint64_t WRT_PROT_SEC_52:1;
      uint64_t WRT_PROT_SEC_53:1;
      uint64_t WRT_PROT_SEC_54:1;
      uint64_t WRT_PROT_SEC_55:1;
      uint64_t WRT_PROT_SEC_56:1;
      uint64_t WRT_PROT_SEC_57:1;
      uint64_t WRT_PROT_SEC_58:1;
      uint64_t WRT_PROT_SEC_59:1;
      uint64_t WRT_PROT_SEC_60:1;
      uint64_t WRT_PROT_SEC_61:1;
      uint64_t WRT_PROT_SEC_62:1;
      uint64_t WRT_PROT_SEC_63:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCFG_PROT_63_32;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WRT_PROT_SEC_64:1;
      uint64_t WRT_PROT_SEC_65:1;
      uint64_t WRT_PROT_SEC_66:1;
      uint64_t WRT_PROT_SEC_67:1;
      uint64_t WRT_PROT_SEC_68:1;
      uint64_t WRT_PROT_SEC_69:1;
      uint64_t WRT_PROT_SEC_70:1;
      uint64_t WRT_PROT_SEC_71:1;
      uint64_t WRT_PROT_SEC_72:1;
      uint64_t WRT_PROT_SEC_73:1;
      uint64_t WRT_PROT_SEC_74:1;
      uint64_t WRT_PROT_SEC_75:1;
      uint64_t WRT_PROT_SEC_76:1;
      uint64_t WRT_PROT_SEC_77:1;
      uint64_t WRT_PROT_SEC_78:1;
      uint64_t WRT_PROT_SEC_79:1;
      uint64_t WRT_PROT_SEC_80:1;
      uint64_t WRT_PROT_SEC_81:1;
      uint64_t WRT_PROT_SEC_82:1;
      uint64_t WRT_PROT_SEC_83:1;
      uint64_t WRT_PROT_SEC_84:1;
      uint64_t WRT_PROT_SEC_85:1;
      uint64_t WRT_PROT_SEC_86:1;
      uint64_t WRT_PROT_SEC_87:1;
      uint64_t WRT_PROT_SEC_88:1;
      uint64_t WRT_PROT_SEC_89:1;
      uint64_t WRT_PROT_SEC_90:1;
      uint64_t WRT_PROT_SEC_91:1;
      uint64_t WRT_PROT_SEC_92:1;
      uint64_t WRT_PROT_SEC_93:1;
      uint64_t WRT_PROT_SEC_94:1;
      uint64_t WRT_PROT_SEC_95:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCFG_PROT_95_64;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WRT_PROT_SEC_96:1;
      uint64_t WRT_PROT_SEC_97:1;
      uint64_t WRT_PROT_SEC_98:1;
      uint64_t WRT_PROT_SEC_99:1;
      uint64_t WRT_PROT_SEC_100:1;
      uint64_t WRT_PROT_SEC_101:1;
      uint64_t WRT_PROT_SEC_102:1;
      uint64_t WRT_PROT_SEC_103:1;
      uint64_t WRT_PROT_SEC_104:1;
      uint64_t WRT_PROT_SEC_105:1;
      uint64_t WRT_PROT_SEC_106:1;
      uint64_t WRT_PROT_SEC_107:1;
      uint64_t WRT_PROT_SEC_108:1;
      uint64_t WRT_PROT_SEC_109:1;
      uint64_t WRT_PROT_SEC_110:1;
      uint64_t WRT_PROT_SEC_111:1;
      uint64_t WRT_PROT_SEC_112:1;
      uint64_t WRT_PROT_SEC_113:1;
      uint64_t WRT_PROT_SEC_114:1;
      uint64_t WRT_PROT_SEC_115:1;
      uint64_t WRT_PROT_SEC_116:1;
      uint64_t WRT_PROT_SEC_117:1;
      uint64_t WRT_PROT_SEC_118:1;
      uint64_t WRT_PROT_SEC_119:1;
      uint64_t WRT_PROT_SEC_120:1;
      uint64_t WRT_PROT_SEC_121:1;
      uint64_t WRT_PROT_SEC_122:1;
      uint64_t WRT_PROT_SEC_123:1;
      uint64_t WRT_PROT_SEC_124:1;
      uint64_t WRT_PROT_SEC_125:1;
      uint64_t WRT_PROT_SEC_126:1;
      uint64_t WRT_PROT_SEC_127:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCFG_PROT_127_96;

