iSYSTEMLabs/winIDEAExampleWorkspaces/TI/CC2650/emptyTargetInit/CC2650_sfr.h
};

#define CCFG (*(volatile struct CCFG_tag *) 0x50003fa8)

struct CPU_TIPROP_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRACECLK_N_SWV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRACECLKMUX;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DYN_CG:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DYN_CG;

};

#define CPU_TIPROP (*(volatile struct CPU_TIPROP_tag *) 0xe00feff8)

struct EVENT_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t EV:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPUIRQSEL0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EV:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPUIRQSEL1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EV:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPUIRQSEL2;

  uint32_t CPUIRQSEL3;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t EV:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPUIRQSEL4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EV:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPUIRQSEL5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EV:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPUIRQSEL6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EV:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPUIRQSEL7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EV:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPUIRQSEL8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EV:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPUIRQSEL9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EV:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPUIRQSEL10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EV:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPUIRQSEL11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EV:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPUIRQSEL12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EV:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPUIRQSEL13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EV:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPUIRQSEL14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EV:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPUIRQSEL15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EV:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPUIRQSEL16;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EV:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPUIRQSEL17;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EV:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPUIRQSEL18;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EV:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPUIRQSEL19;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EV:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPUIRQSEL20;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EV:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPUIRQSEL21;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EV:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPUIRQSEL22;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EV:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPUIRQSEL23;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EV:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPUIRQSEL24;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EV:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPUIRQSEL25;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EV:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPUIRQSEL26;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EV:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPUIRQSEL27;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EV:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPUIRQSEL28;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EV:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPUIRQSEL29;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EV:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPUIRQSEL30;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EV:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPUIRQSEL31;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EV:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPUIRQSEL32;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EV:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPUIRQSEL33;

  uint8_t res0[120];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EV:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RFCSEL0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EV:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RFCSEL1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EV:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RFCSEL2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EV:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RFCSEL3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EV:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RFCSEL4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EV:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RFCSEL5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EV:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RFCSEL6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EV:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RFCSEL7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EV:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RFCSEL8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EV:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RFCSEL9;

  uint8_t res1[216];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EV:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPT0ACAPTSEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EV:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPT0BCAPTSEL;

  uint8_t res2[248];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EV:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPT1ACAPTSEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EV:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPT1BCAPTSEL;

  uint8_t res3[248];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EV:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPT2ACAPTSEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EV:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPT2BCAPTSEL;

  uint8_t res4[256];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EV:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UDMACH1SSEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EV:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UDMACH1BSEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EV:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UDMACH2SSEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EV:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UDMACH2BSEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EV:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UDMACH3SSEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EV:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UDMACH3BSEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EV:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UDMACH4SSEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EV:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UDMACH4BSEL;

  uint32_t UDMACH5SSEL;
  uint32_t UDMACH5BSEL;
  uint32_t UDMACH6SSEL;
  uint32_t UDMACH6BSEL;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t EV:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UDMACH7SSEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EV:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UDMACH7BSEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EV:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UDMACH8SSEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EV:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UDMACH8BSEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EV:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UDMACH9SSEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EV:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UDMACH9BSEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EV:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UDMACH10SSEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EV:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UDMACH10BSEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EV:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UDMACH11SSEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EV:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UDMACH11BSEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EV:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UDMACH12SSEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EV:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UDMACH12BSEL;

