iSYSTEMLabs/winIDEAExampleWorkspaces/TI/CC2650/emptyTargetInit/CC2650_sfr.h
  uint8_t res10[32];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GPIO_CNT:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IOCONF;

  uint8_t res11[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IFANALDO_TRIM_OUTPUT:5;
      uint64_t IFDIGLDO_TRIM_OUTPUT:5;
      uint64_t INT2ADJ:4;
      uint64_t AAFCAP:2;
      uint64_t FF1ADJ:4;
      uint64_t INT3ADJ:4;
      uint64_t FF3ADJ:4;
      uint64_t FF2ADJ:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CONFIG_IF_ADC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RCOSCLF_RTUNE_TRIM:2;
      uint64_t RCOSCLF_CTUNE_TRIM:8;
      uint64_t XOSC_HF_COLUMN_Q12:16;
      uint64_t XOSC_HF_ROW_Q12:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CONFIG_OSC_TOP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RFLDO_TRIM_OUTPUT:7;
      uint64_t reservedSpace0:6;
      uint64_t PATRIMCOMPLETE_N:1;
      uint64_t CTL_PA0_TRIM:5;
      uint64_t IFAMP_TRIM:5;
      uint64_t LNA_IB:4;
      uint64_t IFAMP_IB:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CONFIG_RF_FRONTEND;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SLDO_TRIM_OUTPUT:6;
      uint64_t LDOVCO_TRIM_OUTPUT:6;
      uint64_t RFC_MDM_DEMIQMC0:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CONFIG_SYNTH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SOC_ADC_ABS_GAIN_TEMP1:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SOC_ADC_ABS_GAIN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SOC_ADC_REL_GAIN_TEMP1:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SOC_ADC_REL_GAIN;

  uint8_t res12[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SOC_ADC_ABS_OFFSET_TEMP1:8;
      uint64_t reservedSpace0:8;
      uint64_t SOC_ADC_REL_OFFSET_TEMP1:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SOC_ADC_OFFSET_INT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SOC_ADC_REF_VOLTAGE_TRIM_TEMP1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SOC_ADC_REF_TRIM_AND_OFFSET_EXT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HPMRAMP1_TH:6;
      uint64_t IBIASCAP_LPTOHP_OL_CNT:4;
      uint64_t HPMRAMP3_HTH:6;
      uint64_t reservedSpace0:2;
      uint64_t HPMRAMP3_LTH:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AMPCOMP_TH1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t ADC_COMP_AMPTH_HPM:6;
      uint64_t reservedSpace1:2;
      uint64_t ADC_COMP_AMPTH_LPM:6;
      uint64_t reservedSpace2:2;
      uint64_t LPMUPDATE_HTM:6;
      uint64_t reservedSpace3:2;
      uint64_t LPMUPDATE_LTH:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AMPCOMP_TH2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IBIASCAP_HPTOLP_OL_CNT:4;
      uint64_t CAP_STEP:4;
      uint64_t LPM_IBIAS_WAIT_CNT_FINAL:8;
      uint64_t IBIAS_INIT:4;
      uint64_t IBIAS_OFFSET:4;
      uint64_t reservedSpace0:6;
      uint64_t AMPCOMP_REQ_MODE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AMPCOMP_CTRL1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XOSC_HF_IBIASTHERM:14;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ANABYPASS_VALUE2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DACTRIM:6;
      uint64_t QUANTCTLTHRES:3;
      uint64_t RSSI_OFFSET:8;
      uint64_t RSSITRIMCOMPLETE_N:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CONFIG_MISC_ADC;

  uint8_t res13[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRIMBOD_H:5;
      uint64_t reservedSpace0:3;
      uint64_t VDDR_TRIM_SLEEP_H:5;
      uint64_t reservedSpace1:3;
      uint64_t VDDR_TRIM_H:5;
      uint64_t reservedSpace2:3;
      uint64_t VDDR_TRIM_HH:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) VOLT_TRIM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:18;
      uint64_t XOSC_OPTION:1;
      uint64_t XOSC_HF_FAST_START:2;
      uint64_t XOSCLF_CMIRRWR_RATIO:4;
      uint64_t XOSCLF_REGULATOR_TRIM:2;
      uint64_t ATESTLF_RCOSCLF_IBIAS_TRIM:1;
      uint64_t ADC_SH_MODE_EN:1;
      uint64_t ADC_SH_VBUF_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OSC_CONF;

  uint8_t res14[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLUX_CAP_0P4_TRIM:16;
      uint64_t FLUX_CAP_0P28_TRIM:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAP_TRIM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IDAC_STEP:4;
      uint64_t LPM_IBIAS_WAIT_CNT:6;
      uint64_t HPM_IBIAS_WAIT_CNT:10;
      uint64_t DBLR_LOOP_FILTER_RESET_VOLTAGE:2;
      uint64_t LP_BUF_ITRIM:2;
      uint64_t HP_BUF_ITRIM:3;
      uint64_t PEAK_DET_ITRIM:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MISC_OTP_DATA_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BASELINE:8;
      uint64_t DELTA_XOSC_LPM:8;
      uint64_t DELTA_RFMEM_RET:8;
      uint64_t DELTA_CACHE_REF:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWD_CURR_20C;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BASELINE:8;
      uint64_t DELTA_XOSC_LPM:8;
      uint64_t DELTA_RFMEM_RET:8;
      uint64_t DELTA_CACHE_REF:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWD_CURR_35C;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BASELINE:8;
      uint64_t DELTA_XOSC_LPM:8;
      uint64_t DELTA_RFMEM_RET:8;
      uint64_t DELTA_CACHE_REF:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWD_CURR_50C;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BASELINE:8;
      uint64_t DELTA_XOSC_LPM:8;
      uint64_t DELTA_RFMEM_RET:8;
      uint64_t DELTA_CACHE_REF:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWD_CURR_65C;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BASELINE:8;
      uint64_t DELTA_XOSC_LPM:8;
      uint64_t DELTA_RFMEM_RET:8;
      uint64_t DELTA_CACHE_REF:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWD_CURR_80C;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BASELINE:8;
      uint64_t DELTA_XOSC_LPM:8;
      uint64_t DELTA_RFMEM_RET:8;
      uint64_t DELTA_CACHE_REF:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWD_CURR_95C;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BASELINE:8;
      uint64_t DELTA_XOSC_LPM:8;
      uint64_t DELTA_RFMEM_RET:8;
      uint64_t DELTA_CACHE_REF:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWD_CURR_110C;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BASELINE:8;
      uint64_t DELTA_XOSC_LPM:8;
      uint64_t DELTA_RFMEM_RET:8;
      uint64_t DELTA_CACHE_REF:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWD_CURR_125C;

