iSYSTEMLabs/winIDEAExampleWorkspaces/TI/CC2650/emptyTargetInit/CC2650_sfr.h
  uint8_t res5[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROTL1DIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FBPROT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BSE:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FBSE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BUSY:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FBBUSY;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VREADS:8;
      uint64_t BAGP:8;
      uint64_t OTPPROTDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FBAC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BANKPWR0:2;
      uint64_t BANKPWR1:2;
      uint64_t BANKPWR2:2;
      uint64_t BANKPWR3:2;
      uint64_t BANKPWR4:2;
      uint64_t BANKPWR5:2;
      uint64_t BANKPWR6:2;
      uint64_t BANKPWR7:2;
      uint64_t REG_PWRSAV:4;
      uint64_t reservedSpace0:4;
      uint64_t FSM_PWRSAV:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FBFALLBACK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BANKRDY:1;
      uint64_t reservedSpace0:14;
      uint64_t PUMPRDY:1;
      uint64_t BANKBUSY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FBPRDY;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PUMPPWR:2;
      uint64_t reservedSpace0:2;
      uint64_t PUMPRESET_PW:12;
      uint64_t PSLEEPTDIS:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FPAC1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PAGP:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FPAC2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BANK:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FMAC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SLOCK:1;
      uint64_t PSUSP:1;
      uint64_t ESUSP:1;
      uint64_t VOLSTAT:1;
      uint64_t CSTAT:1;
      uint64_t INVDAT:1;
      uint64_t PGM:1;
      uint64_t ERS:1;
      uint64_t BUSY:1;
      uint64_t CV:1;
      uint64_t EV:1;
      uint64_t PCV:1;
      uint64_t PGV:1;
      uint64_t DBF:1;
      uint64_t ILA:1;
      uint64_t RVF:1;
      uint64_t RDVER:1;
      uint64_t RVSUSP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FMSTAT;

  uint8_t res6[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENCOM:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLOCK;

  uint8_t res7[24];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VREADCT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FVREADCT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VHVCT_PV:4;
      uint64_t TRIM13_PV:4;
      uint64_t reservedSpace0:8;
      uint64_t VHVCT_E:4;
      uint64_t TRIM13_E:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FVHVCT1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t VHVCT_P:4;
      uint64_t TRIM13_P:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FVHVCT2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VHVCT_READ:4;
      uint64_t reservedSpace0:12;
      uint64_t WCT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FVHVCT3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VIN_CT:5;
      uint64_t reservedSpace0:3;
      uint64_t VCG2P5CT:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FVNVCT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:12;
      uint64_t VSL_P:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FVSLP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VWLCT_P:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FVWLCT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EFUSE_EN:4;
      uint64_t EF_TEST:1;
      uint64_t reservedSpace0:3;
      uint64_t EF_CLRZ:1;
      uint64_t reservedSpace1:7;
      uint64_t BP_SEL:1;
      uint64_t WRITE_EN:1;
      uint64_t reservedSpace2:6;
      uint64_t CHAIN_SEL:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FEFUSECTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SHIFT_DONE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FEFUSESTAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEFUSEDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FEFUSEDATA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t VIN_BY_PASS:1;
      uint64_t reservedSpace1:3;
      uint64_t VIN_AT_X:3;
      uint64_t reservedSpace2:1;
      uint64_t TRIM_0P8:4;
      uint64_t TRIM_1P7:2;
      uint64_t reservedSpace3:2;
      uint64_t TRIM_3P4:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FSEQPMP;

  uint8_t res8[84];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t TEZ:1;
      uint64_t OTP:1;
      uint64_t TI_OTP:1;
      uint64_t PRECOL:1;
      uint64_t NOCOLRED:1;
      uint64_t reservedSpace1:1;
      uint64_t CTRLENZ:1;
      uint64_t reservedSpace2:7;
      uint64_t FLCLKEN:1;
      uint64_t RWAIT_FLCLK:1;
      uint64_t RWAIT2_FLCLK:1;
      uint64_t reservedSpace3:5;
      uint64_t ECBIT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FBSTROBES;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t V5PWRDNZ:1;
      uint64_t V3PWRDNZ:1;
      uint64_t reservedSpace0:6;
      uint64_t EXECUTEZ:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FPSTROBES;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FBMODE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TCR:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FADDR;

  uint8_t res9[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t TEST_EN:1;
      uint64_t reservedSpace1:14;
      uint64_t WDATA_BLK_CLR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTCTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FWPWRITE0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FWPWRITE0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FWPWRITE1:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FWPWRITE1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FWPWRITE2:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FWPWRITE2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FWPWRITE3:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FWPWRITE3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FWPWRITE4:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FWPWRITE4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FWPWRITE5:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FWPWRITE5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FWPWRITE6:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FWPWRITE6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FWPWRITE7:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FWPWRITE7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ECCBYTES31_24:8;
      uint64_t ECCBYTES23_16:8;
      uint64_t ECCBYTES15_08:8;
      uint64_t ECCBYTES07_00:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FWPWRITE_ECC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SAFELV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FSWSTAT;

  uint8_t res10[184];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLKSEL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FSM_GLBCTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:6;
      uint64_t OTP_ACT:1;
      uint64_t TIOTP_ACT:1;
      uint64_t FSM_ACT:1;
      uint64_t reservedSpace1:1;
      uint64_t EXECUTEZ:1;
      uint64_t CTRLENZ:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FSM_STATE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INV_DAT:1;
      uint64_t OVR_PUL_CNT:1;
      uint64_t NON_OP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FSM_STAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSMCMD:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FSM_CMD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ERA_OSU:8;
      uint64_t PGM_OSU:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FSM_PE_OSU;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:12;
      uint64_t VSTAT_CNT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FSM_VSTAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ERA_VSU:8;
      uint64_t PGM_VSU:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FSM_PE_VSU;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:12;
      uint64_t ADD_EXZ:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FSM_CMP_VSU;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EXE_VALD:8;
      uint64_t REP_VSU:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FSM_EX_VAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RD_H:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FSM_RD_H;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t PGM_OH:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FSM_P_OH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ERA_OH:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FSM_ERA_OH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SAV_P_PUL:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FSM_SAV_PPUL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t PGM_VH:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FSM_PE_VH;

  uint8_t res11[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROG_PUL_WIDTH:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FSM_PRG_PW;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSM_ERA_PW:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FSM_ERA_PW;

