iSYSTEMLabs/winIDEAExampleWorkspaces/TI/CC2650/emptyTargetInit/CC2650_sfr.h
};

#define SMPH (*(volatile struct SMPH_tag *) 0x40084000)

struct SSI0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t DSS:4;
      uint64_t FRF:2;
      uint64_t SPO:1;
      uint64_t SPH:1;
      uint64_t SCR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LBM:1;
      uint64_t SSE:1;
      uint64_t MS:1;
      uint64_t SOD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TFE:1;
      uint64_t TNF:1;
      uint64_t RNE:1;
      uint64_t RFF:1;
      uint64_t BSY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CPSDVSR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RORIM:1;
      uint64_t RTIM:1;
      uint64_t RXIM:1;
      uint64_t TXIM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMSC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RORRIS:1;
      uint64_t RTRIS:1;
      uint64_t RXRIS:1;
      uint64_t TXRIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RIS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RORMIS:1;
      uint64_t RTMIS:1;
      uint64_t RXMIS:1;
      uint64_t TXMIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MIS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RORIC:1;
      uint64_t RTIC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDMAE:1;
      uint64_t TXDMAE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMACR;

};

#define SSI0 (*(volatile struct SSI0_tag *) 0x40000000)

struct SSI1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t DSS:4;
      uint64_t FRF:2;
      uint64_t SPO:1;
      uint64_t SPH:1;
      uint64_t SCR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LBM:1;
      uint64_t SSE:1;
      uint64_t MS:1;
      uint64_t SOD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TFE:1;
      uint64_t TNF:1;
      uint64_t RNE:1;
      uint64_t RFF:1;
      uint64_t BSY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CPSDVSR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RORIM:1;
      uint64_t RTIM:1;
      uint64_t RXIM:1;
      uint64_t TXIM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMSC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RORRIS:1;
      uint64_t RTRIS:1;
      uint64_t RXRIS:1;
      uint64_t TXRIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RIS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RORMIS:1;
      uint64_t RTMIS:1;
      uint64_t RXMIS:1;
      uint64_t TXMIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MIS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RORIC:1;
      uint64_t RTIC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDMAE:1;
      uint64_t TXDMAE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMACR;

};

#define SSI1 (*(volatile struct SSI1_tag *) 0x40008000)

struct TRNG_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t VALUE_31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OUT0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VALUE_63_32:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OUT1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RDY:1;
      uint64_t SHUTDOWN_OVF:1;
      uint64_t reservedSpace0:29;
      uint64_t NEED_CLOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQFLAGSTAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RDY:1;
      uint64_t SHUTDOWN_OVF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQFLAGMASK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RDY:1;
      uint64_t SHUTDOWN_OVF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQFLAGCLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t TEST_MODE:1;
      uint64_t NO_LFSR_FB:1;
      uint64_t reservedSpace1:7;
      uint64_t TRNG_EN:1;
      uint64_t reservedSpace2:5;
      uint64_t STARTUP_CYCLES:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MIN_REFILL_CYCLES:8;
      uint64_t SMPL_DIV:4;
      uint64_t reservedSpace0:4;
      uint64_t MAX_REFILL_CYCLES:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ALARM_THR:8;
      uint64_t reservedSpace0:8;
      uint64_t SHUTDOWN_THR:5;
      uint64_t reservedSpace1:3;
      uint64_t SHUTDOWN_CNT:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ALARMCNT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FRO_MASK:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FROEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FRO_MASK:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FRODETUNE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FRO_MASK:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ALARMMASK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FRO_FLAGS:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ALARMSTOP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LFSR_31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LFSR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LFSR_63_32:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LFSR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LFSR_80_64:17;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LFSR2;

